---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.LevelOffset
source: html/865f446a-2f1b-9136-6cec-1a4d30cfb864.htm
---
# Autodesk.Revit.DB.FabricationPart.LevelOffset Property

The associated level offset that indicates the distance from the center of the fabrication part to the current level.

## Syntax (C#)
```csharp
public double LevelOffset { get; }
```